#pragma once

/*
* Object-Oriented Programming [OOP]
* 객체 지향 프로그래밍
*	- 컴퓨터 프로그램을 명령어의 목록으로 보는 시각에서 벗어남
*	- 여러 개의 독립된 단위, 즉 "객체"들의 모임으로 파악하고자 하는 것
*	- 각각의 객체들은 메시지를 주고받고, 데이터를 처리할 수 있다
* 
* 기본 구성 요소
*	1) Class
*		- 집단의 속성과 행위를 정의
*		- 객체지향 프로그램의 기본적인 사용자 정의 데이터형
*		- 클래스는 다른 클래스 또는 외부 요소와 독립적으로 디자인
*	2) Object
*		- 클래스의 인스턴스
*			- 인스턴스 : 실제로 메모리상에 할당된 것
*		- 객체는 자신 고유의 속성을 가지며 클래스에서 정의한 행위를 수행
*		- 객체의 행위는 클래스에 정의된 행위를 공유함으로써 메모리를 경제적으로
*		  사용
*	3) Method, Message
* 
* 특징
*	1) 추상화
*	2) 캡슐화
*	3) 정보 은닉
*	4) 상속성
*	5) 다형성
*/